ㅌ/*
** =================================================================================================
** 시 스 템 명 : YZ (수익관리)
** 화  면  ID : YSAB001_P01
** 화  면  명 : 예약발매요청열차 수신확인
** 개      요 : 예약발매요청열차가 수신되었는지를 확인한다
** ================================================================================================= 
** << 변경 정보 >>
** -------------------------------------------------------------------------------------------------
** 변 경 일 자  : 변경자 : 변	경	내	역
** -------------------------------------------------------------------------------------------------
** 2014-04-09 : 한현섭 : 신규작성
** YYYY-MM-DD :  
** =================================================================================================
*/

/* 
** ========================================================================
** 1. 전역 변수 영역
** ======================================================================== 
*/

/*
** ========================================================================
** 2. 화면 이벤트 영역
** ========================================================================
*/

/*
* 화면 온로드
*/ 
function screen_on_load()
{
	//KRI.init(screen);	// 화면 초기화 (필수) 로컬테스트 에러?
	fn_grd_init();

}

/*
* 스크린 사이즈 변경시
*/ 
function screen_on_size(window_width, window_height)
{
	KRI.processResize(screen, window_width, window_height);
}

/* 
* submit 완료시 호출
*/
function screen_on_submitcomplete(mapid, result, recv_userheader, recv_code, recv_msg)
{
	if (KRI.submitComplete(screen, mapid, result, recv_userheader, recv_code, recv_msg) == false) return;
}

/*
** ========================================================================
** 3. 필수 구현 함수 영역
** ========================================================================
*/

/*
* 화면이 리사이징 될때 변동될 컨트롤정보를 등록한다.
*/
function processResize()
{

}


/*
** ========================================================================
** 4. 사용자 정의 함수 영역
** ========================================================================
*/

function fn_grd_init()
{
	var sTranMapId = "/yz/ys/ab/selectRsvSaleDmnTrnRcvPrsStt.do"
	KRI.requestSubmit(screen, sTranMapId, true);
}
/*
** ========================================================================
** 5. 컨트롤 이벤트 영역
** ========================================================================
*/



function btnClose_on_mouseup(objInst)
{
	KRI.unloadPopup(screen);
}

function fnTImer_on_time(objInst)
{
	KRLog.trace("YSAB001_P01-->Interval");
	fn_grd_init();
}